TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_dac12.h
/** @enum DL_DAC12_FIFO_TRIGGER */
typedef enum {
    /*!  DAC FIFO read trigger sourced from the sample time generator */
    DL_DAC12_FIFO_TRIGGER_SAMPLETIMER = DAC12_CTL2_FIFOTRIGSEL_STIM,
    /*!  DAC FIFO read trigger sourced from the hardware trigger 0 event fabric */
    DL_DAC12_FIFO_TRIGGER_HWTRIG0 = DAC12_CTL2_FIFOTRIGSEL_TRIG0,
} DL_DAC12_FIFO_TRIGGER;

/** @enum DL_DAC12_DMA_TRIGGER */
typedef enum {
    /*!  DMA trigger mechanism for DAC is disabled */
    DL_DAC12_DMA_TRIGGER_DISABLED = DAC12_CTL2_DMATRIGEN_CLR,
    /*!  DMA trigger mechanism for DAC is enabled */
    DL_DAC12_DMA_TRIGGER_ENABLED = DAC12_CTL2_DMATRIGEN_SET,
} DL_DAC12_DMA_TRIGGER;

/** @enum DL_DAC12_CALIBRATION */
typedef enum {

    /*! Factory Trim */
    DL_DAC12_CALIBRATION_FACTORY = DAC12_CALCTL_CALSEL_FACTORYTRIM,
    /*! Self Trim (last calibration result) */
    DL_DAC12_CALIBRATION_SELF = DAC12_CALCTL_CALSEL_SELFCALIBRATIONTRIM,

} DL_DAC12_CALIBRATION;

/** @addtogroup DL_DAC12_INTERRUPT
 *  @{
 */

/*!
 *  @brief Interrupt raised when the module ready event has occurred
 */
#define DL_DAC12_INTERRUPT_MODULE_READY             (DAC12_GEN_EVENT_IMASK_MODRDYIFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is empty
 */
#define DL_DAC12_INTERRUPT_FIFO_EMPTY            (DAC12_GEN_EVENT_IMASK_FIFOEMPTYIFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is 3/4th empty
 */
#define DL_DAC12_INTERRUPT_FIFO_THREE_QTRS_EMPTY   (DAC12_GEN_EVENT_IMASK_FIFO3B4IFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is 2/4ths empty
 */
#define DL_DAC12_INTERRUPT_FIFO_TWO_QTRS_EMPTY     (DAC12_GEN_EVENT_IMASK_FIFO1B2IFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is 1/4th empty
 */
#define DL_DAC12_INTERRUPT_FIFO_ONE_QTR_EMPTY      (DAC12_GEN_EVENT_IMASK_FIFO1B4IFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is full
 */
#define DL_DAC12_INTERRUPT_FIFO_FULL              (DAC12_GEN_EVENT_IMASK_FIFOFULLIFG_SET)

/*!
 *  @brief Interrupt raised when the FIFO is underrun
 *         (tried to read from an empty FIFO)
 */
#define DL_DAC12_INTERRUPT_FIFO_UNDERRUN          (DAC12_GEN_EVENT_IMASK_FIFOURUNIFG_SET)

/*!
 *  @brief Interrupt raised as an Acknowledgement to the DMA completing a
 *         transfer
 *
 *  During DMA operation only, once the DMA has performed its desired number
 *  of transfers to the FIFO, the DMA will assert a DMA done event. The DMA will
 *  also send a status, which is 0 if there is more data to send. If there is a
 *  nonzero status, and the DMA is done sending information, the DMATrigger will
 *  be disabled and this interrupt will be asserted.
 */
#define DL_DAC12_INTERRUPT_DMA_DONE                (DAC12_GEN_EVENT_IMASK_DMADONEIFG_SET)

/** @}*/

/** @addtogroup DL_DAC12_EVENT
 *  @{
 */

/*!
 *  @brief Event raised when the module ready event has occurred
 */
#define DL_DAC12_EVENT_MODULE_READY             (DAC12_GEN_EVENT_IMASK_MODRDYIFG_SET)

/*!
 *  @brief Event raised when the FIFO is empty
 */
#define DL_DAC12_EVENT_FIFO_EMPTY            (DAC12_GEN_EVENT_IMASK_FIFOEMPTYIFG_SET)

/*!
 *  @brief Event raised when the FIFO is 3/4th empty
 */
#define DL_DAC12_EVENT_FIFO_THREE_QTRS_EMPTY   (DAC12_GEN_EVENT_IMASK_FIFO3B4IFG_SET)

/*!
 *  @brief Event raised when the FIFO is 2/4ths empty
 */
#define DL_DAC12_EVENT_FIFO_TWO_QTRS_EMPTY     (DAC12_GEN_EVENT_IMASK_FIFO1B2IFG_SET)

/*!
 *  @brief Event raised when the FIFO is 1/4th empty
 */
#define DL_DAC12_EVENT_FIFO_ONE_QTR_EMPTY      (DAC12_GEN_EVENT_IMASK_FIFO1B4IFG_SET)

/*!
 *  @brief Event raised when the FIFO is full
 */
#define DL_DAC12_EVENT_FIFO_FULL              (DAC12_GEN_EVENT_IMASK_FIFOFULLIFG_SET)

/*!
 *  @brief Event raised when the FIFO is underrun
 *         (tried to read from an empty FIFO)
 */
#define DL_DAC12_EVENT_FIFO_UNDERRUN          (DAC12_GEN_EVENT_IMASK_FIFOURUNIFG_SET)

/*!
 *  @brief Event raised as an Acknowledgement to the DMA completing a
 *         transfer
 *
 *  During DMA operation only, once the DMA has performed its desired number
 *  of transfers to the FIFO, the DMA will assert a DMA done event. The DMA will
 *  also send a status, which is 0 if there is more data to send. If there is a
 *  nonzero status, and the DMA is done sending information, the DMATrigger will
 *  be disabled and this interrupt will be asserted.
 */
#define DL_DAC12_EVENT_DMA_DONE                (DAC12_GEN_EVENT_IMASK_DMADONEIFG_SET)

/** @}*/

/* clang-format on */

/*! @enum DL_DAC12_IIDX */
typedef enum {
    /*! DAC interrupt index for no interrupt pending */
    DL_DAC12_IIDX_NO_INT = DAC12_CPU_INT_IIDX_STAT_NO_INTR,
    /*! DAC interrupt index when module is ready */
    DL_DAC12_IIDX_MODULE_READY = DAC12_CPU_INT_IIDX_STAT_MODRDYIFG,
    /*! DAC interrupt index when FIFO is full */
    DL_DAC12_IIDX_FIFO_FULL = DAC12_CPU_INT_IIDX_STAT_FIFOFULLIFG,
    /*! DAC interrupt index when FIFO is 1/4 empty */
    DL_DAC12_IIDX_FIFO_1_4_EMPTY = DAC12_CPU_INT_IIDX_STAT_FIFO1B4IFG,
    /*! DAC interrupt index when FIFO is 1/2 empty */
    DL_DAC12_IIDX_FIFO_1_2_EMPTY = DAC12_CPU_INT_IIDX_STAT_FIFO1B2IFG,
    /*! DAC interrupt index when FIFO is 3/4 empty */
    DL_DAC12_IIDX_FIFO_3_4_EMPTY = DAC12_CPU_INT_IIDX_STAT_FIFO3B4IFG,
    /*! DAC interrupt index when FIFO is empty */
    DL_DAC12_IIDX_FIFO_EMPTY = DAC12_CPU_INT_IIDX_STAT_FIFOEMPTYIFG,
    /*! DAC interrupt index if there is FIFO underrun */
    DL_DAC12_IIDX_FIFO_UNDERRUN = DAC12_CPU_INT_IIDX_STAT_FIFOURUNIFG,
    /*! DAC interrupt index for DMA transfer done */
    DL_DAC12_IIDX_DMA_DONE = DAC12_CPU_INT_IIDX_STAT_DMADONEIFG
} DL_DAC12_IIDX;

/*! @enum DL_DAC12_SUBSCRIBER_INDEX */
typedef enum {
    /*! DAC12 Subscriber index 0 */
    DL_DAC12_SUBSCRIBER_INDEX_0 = 0,
} DL_DAC12_SUBSCRIBER_INDEX;

/*! @enum DL_DAC12_EVENT_ROUTE */
typedef enum {
    /*! DAC12 event route 1 */
    DL_DAC12_EVENT_ROUTE_1 = 0,
} DL_DAC12_EVENT_ROUTE;

/**
 *  @brief  Configuration struct for @ref DL_DAC12_init
 */
typedef struct {
    /*! Enables the DAC output on the device OUT pin. One of @ref DL_DAC12_OUTPUT */
    DL_DAC12_OUTPUT outputEnable;

